Masmiseim36/nxpSDK/boards/mimxrt700evk/vglite_examples/toolkit_freertos/cm33_core0/vglite_layer.c
/*
 * Copyright 2024-2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/* FreeRTOS kernel includes. */
#include "FreeRTOS.h"
#include "task.h"

#include "stdio.h"
#include "fsl_debug_console.h"
#include "pin_mux.h"
#include "board.h"

#include "vglite_layer.h"


#define QOI_MALLOC(sz) pvPortMalloc(sz)
#define QOI_FREE(p)    vPortFree(p)
#define QOI_IMPLEMENTATION
#define QOI_NO_STDIO
#include "qoi.h"

/* GLobals */
static gradient_cache_entry_t *g_grad_cache = NULL;
static vg_lite_uint32_t g_chip_id;
#define MAX_FONT_CACHE_SZ (27*2)
typedef struct font_glyph_cache_entry {
    uint16_t u16;
    void *path_data;
    int hx; /* horiz-adv-x */
    vg_lite_path_t handle;
}font_glyph_cache_entry_t;

#ifndef TRANSPARENT_VGLITE_COLOUR
/* VGLITE Internal color format is ABGR */
#define TRANSPARENT_VGLITE_COLOUR(a, r, g, b) \
	((uint32_t)(a) << 24) | ((uint32_t)(b) << 16) | ((uint32_t)(g) << 8) | \
	(uint32_t)r
#endif

/* Space horizontal advancement*/
#define SPACE_HX 278

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
vg_lite_error_t layer_create_image_buffers(UILayers_t *layer);
vg_lite_error_t layer_draw_images(vg_lite_buffer_t *rt, UILayers_t *layer, vg_lite_matrix_t *transform_matrix);
vg_lite_error_t layer_free_images(UILayers_t *layer);

static uint32_t ARGB_2_VGLITE_COLOR(uint32_t x)
{
	uint32_t r, g, b, a;
	a = ((x & 0xFF000000)>>24);
	r = ((x & 0x00FF0000)>>16);
	g = ((x & 0x0000FF00)>>8);
	b = ((x & 0x000000FF));

	return TRANSPARENT_VGLITE_COLOUR(a, r, g, b);
}

void matrix_multiply(vg_lite_matrix_t *result, const vg_lite_matrix_t *mat1, const vg_lite_matrix_t *mat2) {
    int row, col, k;

    // Only compute the top two rows (0 and 1) for 2D affine transform
    for (row = 0; row < 2; row++) {
        for (col = 0; col < 3; col++) {
            result->m[row][col] = 0.0f;
            for (k = 0; k < 3; k++) {
                result->m[row][col] += mat1->m[row][k] * mat2->m[k][col];
            }
        }
    }

    // Set the fixed bottom row for 2D affine transform
    result->m[2][0] = 0.0f;
    result->m[2][1] = 0.0f;
    result->m[2][2] = 1.0f;
}

static int is_matrix_identical(vg_lite_matrix_t * m1, vg_lite_matrix_t * m2)
{
    int row;

    for (row = 0; row < 3; row++) {
        if (m1->m[row][0] != m2->m[row][0])
            return 0;
        if (m1->m[row][1] != m2->m[row][1])
            return 0;
        if (m1->m[row][2] != m2->m[row][2])
            return 0;
    }
    return 1;
}

vg_lite_error_t gradient_cache_init(void)
{
    g_grad_cache = (gradient_cache_entry_t*) pvPortMalloc(MAX_GRADIENT_CACHE * sizeof(gradient_cache_entry_t));
    if (g_grad_cache == NULL) {
        PRINTF("Error: Memory allocation failed for g_grad_cache!\n");
        return VG_LITE_OUT_OF_MEMORY;
    }
    memset(g_grad_cache, 0, MAX_GRADIENT_CACHE * sizeof(g_grad_cache));

    return VG_LITE_SUCCESS;
}

void gradient_cache_free(void)
{
    int i;
    if (g_grad_cache != NULL) {
        for (i = 0; i < MAX_GRADIENT_CACHE; i++) {
            if (g_grad_cache[i].g != NULL) {
                if (g_grad_cache[i].type == eLinearGradientCacheEntry && g_chip_id != 0x255) {
                    vg_lite_clear_linear_grad(&g_grad_cache[i].grad_data.lg.lGradient);
                } else if (g_grad_cache[i].type == eRadialGradientCacheEntry && g_chip_id != 0x255) {
                    vg_lite_clear_radial_grad(&g_grad_cache[i].grad_data.rg.rGradient);
                } else if(g_grad_cache[i].type == eLinearGradientCacheEntry && g_chip_id == 0x255){
                    vg_lite_clear_grad(&g_grad_cache[i].grad_data.linear_basic.basic_gradient);
                }
            }
        }
        vPortFree(g_grad_cache);
        g_grad_cache = NULL;
    }
}

static vg_lite_error_t get_gpu_chip_info(void)
{
    vg_lite_uint32_t chip_rev = 0;

    // Get product info and pass g_chip_id as a pointer
    vg_lite_get_product_info(NULL, &g_chip_id, &chip_rev);

    // Check g_chip_id for supported values (0x255, 0x355, 0x555)
    if (g_chip_id == 0x255 || g_chip_id == 0x355 || g_chip_id == 0x555) {
        return VG_LITE_SUCCESS;
    } else {
        // Print error messages for mismatch
        printf("\r\nVGLite API initialization Error!!! \nHardware ChipId: 0x%X \r\n\r\n", g_chip_id);
        printf("\r\nNOT match vg_lite_options.h CHIPID: 0x%X\r\n\r\n", g_chip_id);
        return VG_LITE_NOT_SUPPORT;
    }
}


// Updated function to prepare colors/stops for legacy API
static void prepare_legacy_gradient_data(const vg_lite_color_ramp_t *ramp, int count,
                                       vg_lite_uint32_t *colors, vg_lite_uint32_t *stops) {
    for (int i = 0; i < count; i++) {
        stops[i] = (vg_lite_uint32_t)(ramp[i].stop * 255.0f);
        colors[i] = ((uint32_t)(ramp[i].alpha * 255.0f) << 24) |
                   ((uint32_t)(ramp[i].red * 255.0f) << 16) |
                   ((uint32_t)(ramp[i].green * 255.0f) << 8) |
                   (uint32_t)(ramp[i].blue * 255.0f);
    }
}

void _gradient_stop_color_to_vglite_color(int32_t num_stop_points, stopValue_t *stops, vg_lite_color_ramp_t *vgColorRamp)
{
	int i;

	for (i = 0; i < num_stop_points && i < MAX_GRADIENT_STOP_POINTS; i++) {
		vgColorRamp[i].stop = stops[i].offset;
		vgColorRamp[i].red = ((stops[i].stop_color & 0x00FF0000) >> 16) / 255.0f;
		vgColorRamp[i].green = ((stops[i].stop_color & 0x0000FF00) >> 8) / 255.0f;
		vgColorRamp[i].blue = (stops[i].stop_color & 0x000000FF) / 255.0f;
		vgColorRamp[i].alpha = ((stops[i].stop_color & 0xFF000000) >> 24) / 255.0f;
	}
}

vg_lite_error_t gradient_cache_find(void *grad, int type, vg_lite_matrix_t *transform_matrix, gradient_cache_entry_t **ppcachedEntry)
{
	int unused_idx;
    int i;
    vg_lite_error_t error = VG_LITE_SUCCESS;
    gradient_cache_entry_t *cachedGradient = NULL;

    /* Reset output pointer to NULL by default, indicating cache search failed. */
    *ppcachedEntry = NULL;

