Masmiseim36/nxpSDK/boards/mimxrt700evk/vglite_examples/toolkit_freertos/cm33_core0/vglite_layer.c
    if (grad == NULL)
        return VG_LITE_INVALID_ARGUMENT;

    if (! (type == eLinearGradientCacheEntry || type == eRadialGradientCacheEntry))
        return VG_LITE_INVALID_ARGUMENT;

    /* Check if path object for given gradient exists */
	for (i=0; i<MAX_GRADIENT_CACHE; i++) {
		cachedGradient = &g_grad_cache[i];
		if (cachedGradient->g == grad)
		{
			*ppcachedEntry = cachedGradient;
			return VG_LITE_SUCCESS;
		}
	}

	/* Find un-used descriptor */
	unused_idx = -1;
	for (i=1; i<MAX_GRADIENT_CACHE; i++) {
		cachedGradient = &g_grad_cache[i];
		if ( cachedGradient->g == NULL ) {
			unused_idx = i;
		}
	}
	if (unused_idx == -1) {
		return VG_LITE_OUT_OF_MEMORY;
	}

	cachedGradient = &g_grad_cache[unused_idx];
	/* Release memory of last gradient */
	if(cachedGradient->type == eLinearGradientCacheEntry && g_chip_id != 0x255){
		vg_lite_clear_linear_grad(&cachedGradient->grad_data.lg.lGradient);
	} else if(cachedGradient->type == eRadialGradientCacheEntry && g_chip_id != 0x255){
		vg_lite_clear_radial_grad(&cachedGradient->grad_data.rg.rGradient);
	} else if(cachedGradient->type == eLinearGradientCacheEntry && g_chip_id == 0x255){
        vg_lite_clear_grad(&cachedGradient->grad_data.linear_basic.basic_gradient);
    }

	vg_lite_uint32_t colors[MAX_GRADIENT_STOP_POINTS];
	vg_lite_uint32_t stops[MAX_GRADIENT_STOP_POINTS];

	/* Allocate and cache requested gradient descriptor */
	if(type == eLinearGradientCacheEntry && g_chip_id != 0x255){
		linearGradient_t *gradient = (linearGradient_t *)grad;

		_gradient_stop_color_to_vglite_color(
				gradient->num_stop_points,
				gradient->stops,
				cachedGradient->vgColorRamp);

		cachedGradient->grad_data.lg.lGradient.count = gradient->num_stop_points;
		cachedGradient->grad_data.lg.params = gradient->linear_gradient;
		error = vg_lite_set_linear_grad(&cachedGradient->grad_data.lg.lGradient,
				cachedGradient->grad_data.lg.lGradient.count,
				cachedGradient->vgColorRamp,
				cachedGradient->grad_data.lg.params,
				VG_LITE_GRADIENT_SPREAD_PAD, 1);
		if (error != VG_LITE_SUCCESS)
			return error;

                if (is_matrix_identical(&cachedGradient->grad_data.lg.lGradient.matrix,
                        transform_matrix) == 0) {
                    cachedGradient->grad_data.lg.lGradient.matrix = *transform_matrix;
                    error = vg_lite_update_linear_grad(&cachedGradient->grad_data.lg.lGradient);
                }
	} else if(type == eRadialGradientCacheEntry && g_chip_id != 0x255){
		radialGradient_t *gradient = (radialGradient_t *)grad;

		_gradient_stop_color_to_vglite_color(
				gradient->num_stop_points,
				gradient->stops,
				cachedGradient->vgColorRamp);

		cachedGradient->grad_data.rg.rGradient.count = gradient->num_stop_points;
		cachedGradient->grad_data.rg.params = gradient->radial_gradient;

		error = vg_lite_set_radial_grad(&cachedGradient->grad_data.rg.rGradient,
				cachedGradient->grad_data.rg.rGradient.count,
				cachedGradient->vgColorRamp,
				cachedGradient->grad_data.rg.params,
				VG_LITE_GRADIENT_SPREAD_PAD, 1);
		if (error != VG_LITE_SUCCESS)
			return error;

                if (is_matrix_identical(&cachedGradient->grad_data.rg.rGradient.matrix,
                        transform_matrix) == 0) {
                    cachedGradient->grad_data.rg.rGradient.matrix = *transform_matrix;
                    error = vg_lite_update_rad_grad(&cachedGradient->grad_data.rg.rGradient);
                }
	} else if(type == eLinearGradientCacheEntry && g_chip_id == 0x255){
		linearGradient_t *gradient = (linearGradient_t*)grad;

		memset(&cachedGradient->grad_data.linear_basic.basic_gradient, 0, sizeof(vg_lite_linear_gradient_t));
		error = vg_lite_init_grad(&cachedGradient->grad_data.linear_basic.basic_gradient);
		if (error) {
			PRINTF("\r\nERROR: vg_lite_init_grad() failed (err=%d)!\r\n\r\n", error);
			return error;
		}
		_gradient_stop_color_to_vglite_color(gradient->num_stop_points, gradient->stops, cachedGradient->vgColorRamp);

		// Prepare data for legacy API
		prepare_legacy_gradient_data(cachedGradient->vgColorRamp,
                                gradient->num_stop_points,
                                colors, stops);


		// Setup legacy linear_basic gradient
		cachedGradient->grad_data.linear_basic.basic_gradient.count = gradient->num_stop_points;
		error = vg_lite_set_grad(&cachedGradient->grad_data.linear_basic.basic_gradient,
				cachedGradient->grad_data.linear_basic.basic_gradient.count, colors,
				stops);
		if (error != VG_LITE_SUCCESS)
			return error;

		if (is_matrix_identical(&cachedGradient->grad_data.linear_basic.basic_gradient.matrix, transform_matrix) == 0) {
			cachedGradient->grad_data.linear_basic.basic_gradient.matrix = *transform_matrix;
			error = vg_lite_update_grad(&cachedGradient->grad_data.linear_basic.basic_gradient);
		}
	} else if(type == eRadialGradientCacheEntry && g_chip_id == 0x255){
		PRINTF("Error: Radial gradient is not supported for ChipId: 0x%X\r\n", g_chip_id);
    }

	if (error != VG_LITE_SUCCESS)
		return error;

	cachedGradient->g = grad;
	cachedGradient->type = (GradientCacheEntry_t)type;;

	*ppcachedEntry = cachedGradient;
	return VG_LITE_SUCCESS;
}

vg_lite_error_t layer_create_image_buffers(UILayers_t *layer)
{
    vg_lite_error_t err;
    int image_count = layer->img_info->image_count;

    if (image_count > 0) {
        qoi_desc desc;
        int channels = 4;

        layer->dst_images = (vg_lite_buffer_t*) pvPortMalloc(image_count * sizeof(vg_lite_buffer_t));
        if (layer->dst_images == NULL) {
            PRINTF("\r\nERROR: Failed to initialize memory descriptors!\r\n");
            return VG_LITE_OUT_OF_MEMORY;
        }

        layer->dst_img_data = (uint8_t **)pvPortMalloc(image_count * sizeof(uint8_t *));
        if (layer->dst_img_data == NULL) {
            PRINTF("\r\nERROR: Failed to initialize QOI decode memory pointers!\r\n");
            return VG_LITE_OUT_OF_MEMORY;
        }

        for (int j=0; j<image_count; j++)
        {
            image_buf_data_t *raw_img = layer->img_info->raw_images[j];
            vg_lite_buffer_t *dst_img = &layer->dst_images[j];

            if (raw_img->format != VG_LITE_RGBA8888 ) {
                uint8_t *decomp_data = qoi_decode(raw_img->raw_data, raw_img->size, &desc, channels);
                if (!decomp_data) {
                    PRINTF("\r\nERROR: Decompression is failed!\r\n\r\n");
                    return VG_LITE_INVALID_ARGUMENT;
                }
                layer->dst_img_data[j] = decomp_data;
            } else {
                layer->dst_img_data[j] = raw_img->raw_data;
            }

            memset(dst_img, 0, sizeof(vg_lite_buffer_t));
            dst_img->width   = raw_img->img_width;
            dst_img->height  = raw_img->img_height;
            dst_img->stride  = raw_img->img_width * 4;
            dst_img->format  = VG_LITE_RGBA8888;

            err = vg_lite_allocate(dst_img);
            if (err != VG_LITE_SUCCESS) {
                PRINTF("ERROR: Failed to allocate RGBA8888 image buffer (err=%d)!\r\n",
                    err);
                return err;
           }

            dst_img->memory  = layer->dst_img_data[j];
            dst_img->address = (vg_lite_uint32_t)layer->dst_img_data[j];
        }
    }

    return VG_LITE_SUCCESS;
}

vg_lite_error_t layer_draw_images(vg_lite_buffer_t *rt, UILayers_t *layer, vg_lite_matrix_t *transform_matrix)
{
    vg_lite_error_t error;
    vg_lite_matrix_t tmatrix;

