Masmiseim36/nxpSDK/boards/mimxrt700evk/vglite_examples/toolkit_freertos/cm33_core0/vglite_layer.c
int layer_draw(vg_lite_buffer_t *rt, UILayers_t *layer, vg_lite_matrix_t *transform_matrix)
{
	vg_lite_error_t error;

	/* matrix_size_in_float an array of 9 float values */
	const int matrix_size_in_float = 9;
	gradient_cache_entry_t *cachedGradient = NULL;

    if (rt == NULL || layer == NULL || transform_matrix == NULL)
        return VG_LITE_INVALID_ARGUMENT;

    vg_lite_error_t status = get_gpu_chip_info();
    if (status == VG_LITE_NOT_SUPPORT) {
        return VG_LITE_NOT_SUPPORT;
    }

    /* 'i' tracks the number of shape paths, while 't_idx' tracks the number of text paths */
    int i = 0, t_idx = 0;
    for (int idx = 0; idx < layer->img_info->drawable_count; idx++) {
		vg_lite_matrix_t tmatrix;
        char type = layer->img_info->render_sequence[idx];

        switch ((svg_node_t)type) {
            case eRectNode:
            case eCircleNode:
            case eEllipseNode:
            case eLineNode:
            case ePolylineNode:
            case ePolygonNode:
            case ePathNode:
                matrix_multiply(&tmatrix, transform_matrix,
                (const vg_lite_matrix_t *)&layer->img_info->transform[i * matrix_size_in_float]);
                for (int k=0; k<2; k++) {
                    if (NO_FILL_MODE == layer->mode->hybridPath[2 * i + k].fillType)
                        continue;

                    error = vg_lite_set_path_type(&layer->handle[i], layer->mode->hybridPath[2 * i + k].pathType);
                    if (error != VG_LITE_SUCCESS) {
                        PRINTF("\r\nERROR: Invalid path type!\r\n\r\n");
                        return error;
                    }

                    switch (layer->mode->hybridPath[2 * i+k].fillType) {
                    case STROKE:
                    case FILL_CONSTANT:
                        error = vg_lite_draw(rt, &layer->handle[i],
                                layer->mode->fillRule[i],
                                &tmatrix,
                                VG_LITE_BLEND_NONE,
                                ARGB_2_VGLITE_COLOR(layer->color[i]));
                        if (error) {
                            PRINTF("Error: vg_lite_draw() returned error %d\r\n", error);
                            return error;
                        }
                        break;
                    case FILL_LINEAR_GRAD:
                        error = gradient_cache_find(layer->mode->linearGrads[i],
                                eLinearGradientCacheEntry,
                                &tmatrix,
                                &cachedGradient);
                        if (error != VG_LITE_SUCCESS)
                            continue;
                        if (cachedGradient == NULL) {
                            PRINTF("Error: Failed to get cached linear gradient. Please increase MAX_GRADIENT_CACHE.\r\n");
                            return VG_LITE_OUT_OF_MEMORY;
                        }

                        if(g_chip_id == 0x255){
                            error = vg_lite_draw_gradient(rt, &layer->handle[i],
                            layer->mode->fillRule[i], &tmatrix,
                            &cachedGradient->grad_data.linear_basic.basic_gradient, VG_LITE_BLEND_NONE);

                        } else{
                            error = vg_lite_draw_linear_gradient(rt, &layer->handle[i],
                            layer->mode->fillRule[i], &tmatrix,
                            &cachedGradient->grad_data.lg.lGradient, 0, VG_LITE_BLEND_NONE, VG_LITE_FILTER_LINEAR);
                        }
                        if (error != VG_LITE_SUCCESS)
                            return error;
                        break;
                    case FILL_RADIAL_GRAD:
                        error = gradient_cache_find(layer->mode->radialGrads[i],
                                eRadialGradientCacheEntry,
                                &tmatrix,
                                &cachedGradient);
                        if (error != VG_LITE_SUCCESS)
                            return error;
                        if (cachedGradient == NULL) {
                            PRINTF("Error: Failed to get cached radial gradient. Please increase MAX_GRADIENT_CACHE.\n");
                            return VG_LITE_OUT_OF_MEMORY;
                        }
                        if (g_chip_id != 0x255){
                            error = vg_lite_draw_radial_gradient(rt, &layer->handle[i],
                                layer->mode->fillRule[i], &tmatrix,
                                &cachedGradient->grad_data.rg.rGradient, 0, VG_LITE_BLEND_NONE, VG_LITE_FILTER_LINEAR);
                        }

                        if (error != VG_LITE_SUCCESS)
                            return error;
                        break;
                    default:
                        return VG_LITE_INVALID_ARGUMENT;
                    }
                }
                i++;
                break;

            case eTextNode:
                error = layer_draw_text(rt, layer, transform_matrix, t_idx);
                if (error != VG_LITE_SUCCESS)
                    return error;
                t_idx++;
                break;

            case eImageNode:
                error = layer_draw_images(rt, layer, transform_matrix);
                if (error != VG_LITE_SUCCESS)
                    return error;
                break;

            default:
                PRINTF("Error: Unknown node type %d\r\n", type);
                return VG_LITE_INVALID_ARGUMENT;
        }
    }

    vg_lite_finish();

    return VG_LITE_SUCCESS;
}

int layer_init(UILayers_t *layer)
{
    int i;
    vg_lite_error_t vg_err;

    if (layer == NULL)
        return VG_LITE_INVALID_ARGUMENT;

    layer->handle  = (vg_lite_path_t *)pvPortMalloc(layer->img_info->path_count * sizeof(vg_lite_path_t));
    if (layer->handle == NULL) {
		PRINTF("\r\nERROR: Memory allocation failed for path!\r\n\r\n");
		return VG_LITE_OUT_OF_MEMORY;
	}
    memset(layer->handle, 0 , layer->img_info->path_count * sizeof(vg_lite_path_t));
    layer->matrix  = (vg_lite_matrix_t *)pvPortMalloc(layer->img_info->path_count * sizeof(vg_lite_matrix_t));
    if (layer->matrix == NULL) {
		PRINTF("\r\nERROR: Memory allocation failed for matrix!\r\n\r\n");
		return VG_LITE_OUT_OF_MEMORY;
	}
    uint32_t data_size;
    for (i = 0; i < layer->img_info->path_count; i++) {
        path_info_t *path_info = &layer->img_info->paths_info[i];
        data_size = vg_lite_get_path_length(path_info->path_cmds, path_info->path_length, VG_LITE_S32);

        vg_err = vg_lite_init_path(&layer->handle[i], layer->img_info->data_format, VG_LITE_MEDIUM,
               data_size, NULL, 0, 0, 0, 0);
        if (vg_err != VG_LITE_SUCCESS) {
		    PRINTF("\r\nERROR: Failed to initialize graphic artifacts!\r\n\r\n");
		    return vg_err;
	    }

        vg_err = vg_lite_append_path(&layer->handle[i], path_info->path_cmds, path_info->path_args, path_info->path_length);
        if (vg_err != VG_LITE_SUCCESS) {
		    PRINTF("\r\nERROR: vg_lite_append_path failed! Unable to append path data.\r\n\r\n");
		    return vg_err;
	    }

        layer->handle[i].add_end = path_info->end_path_flag;

        for (int k=0; k<2; k++) {
        if(layer->mode->hybridPath[2*i+k].pathType == VG_LITE_DRAW_STROKE_PATH ||
                layer->mode->hybridPath[2*i+k].pathType == VG_LITE_DRAW_FILL_STROKE_PATH)
        {
            stroke_info_t *stroke_info = &layer->img_info->stroke_info[i];
            vg_err = vg_lite_set_stroke(&layer->handle[i],
                    stroke_info->linecap,
                    stroke_info->linejoin,
                    stroke_info->strokeWidth,
                    stroke_info->miterlimit,
                    stroke_info->dashPattern,
                    stroke_info->dashPatternCnt,
                    stroke_info->dashPhase,
                    ARGB_2_VGLITE_COLOR(stroke_info->strokeColor));

            if (vg_err != VG_LITE_SUCCESS) {
                PRINTF("\r\nERROR: %d Failed to initialize graphic artifacts!\r\n\r\n", __LINE__);
                return vg_err;
            }

            vg_err = vg_lite_set_path_type(&layer->handle[i], VG_LITE_DRAW_STROKE_PATH);
            if (vg_err != VG_LITE_SUCCESS) {
                PRINTF("\r\nERROR: Invalid path type!\r\n\r\n");
                return vg_err;
            }

            vg_err = vg_lite_update_stroke(&layer->handle[i]);
            if (vg_err != VG_LITE_SUCCESS) {
                PRINTF("\r\nERROR: %d Failed to initialize graphic artifacts!\r\n\r\n", __LINE__);
                return vg_err;
            }
        }
        }
	}

	vg_err = layer_create_image_buffers(layer);
        if (vg_err != VG_LITE_SUCCESS)
            return vg_err;

        vg_err = layer_font_glyph_cache_init();
        if (vg_err != VG_LITE_SUCCESS)
            return vg_err;

        return VG_LITE_SUCCESS;
}

vg_lite_error_t layer_free(UILayers_t *layer)
{
    if (layer == NULL)
        return VG_LITE_INVALID_ARGUMENT;

    if (layer->handle) {
        vPortFree(layer->handle);
        layer->handle = NULL;
    }
    if (layer->matrix) {
        vPortFree(layer->matrix);
        layer->matrix = NULL;
    }

    layer_free_images(layer);

    layer_font_glyph_cache_free();

    return VG_LITE_SUCCESS;
}


